{
    "product manager": [
        "1. Can you describe your experience with product lifecycles?",
        "2. Can you explain how you gather and analyze information to be used for product development?",
        "3. How do you prioritize your product backlog?",
        "4. How do you work with cross-functional teams?",
        "5. How have you handled a product failure?",
        "6. What strategies do you use to keep up with market trends?",
        "7. Can you describe a time when you helped to launch a new product?",
        "8. How would you assess the usability of our current products?",
        "9. What is your process for developing user personas?",
        "10. How do you bridge the gap between the technical team and business stakeholders?",
        "11. How do you make a business case for a new product or feature?",
        "12. Can you provide an example of a product roadmap you've developed and executed?",
        "13. How do you handle disagreements with stakeholders?",
        "14. What is your experience with Agile methodology?",
        "15. How do you balance short-term needs with long-term product strategy?",
        "16. How do you measure product success?",
        "17. Describe a time when you needed to pivot a product strategy.",
        "18. How do you ensure the voice of the customer is heard within the team?",
        "19. How do you build relationships with key stakeholders?",
        "20. Tell me about your experience using data to drive product decisions.",
        "21. How do you handle scope creep during product development?",
        "22. Can you talk about your experience with competitive analysis?",
        "23. Describe how you have worked with sales and marketing functions to drive product adoption.",
        "24. How do you mitigate risks during product development?",
        "25. Can you talk about a time when you had to make a tough decision regarding a product's feature?",
        "26. How do you communicate product strategy to the team and stakeholders?",
        "27. How do you validate market needs before starting a new product or feature?",
        "28. Talk about a time when you had to manage a hard deadline with a team.",
        "29. How do you manage and deliver trade-offs between cost, time and scope?",
        "30. What is your strategy for pricing products?"
    ],
    "sales engineer": [
        "1. Can you tell us a little about your background and why you've chosen to apply for a Sales Engineer role?",
        "2. How did your education prepare you for this role?",
        "3. What is your level of technical expertise in our industry?",
        "4. Can you describe a time when you had to convince a customer to use your product?",
        "5. What strategies do you use to explain complex technical concepts to non-technical clients?",
        "6. Describe your experience with CRM software.",
        "7. How do you ensure a positive customer experience, especially in dealing with complaints or technical issues?",
        "8. Give an example of a time when you turned a potential customer into a committed customer.",
        "9. Can you explain how you would prepare for a product demonstration?",
        "10. How do you handle rejection or failure in sales?",
        "11. What type of sales approach do you usually adopt and why?",
        "12. Can you describe your experience with sales forecasting?",
        "13. How do you approach a situation where a customer has technical objections to our product?",
        "14. Give an example of a time when you improved the sales process in a significant way.",
        "15. How do you stay updated on industry trends and technological advancements?",
        "16. How do you typically handle customer objections and questions regarding our product?",
        "17. Can you describe how you would conduct a competitive analysis of our market?",
        "18. Have you ever contributed to the development or improvement of a product based on customer feedback?",
        "19. How have you collaborated with marketing teams in the past to achieve sales objectives?",
        "20. Can you explain how you would establish long-term relationships with key clients?",
        "21. How do you typically prepare for client meetings?",
        "22. Describe a time when you had to adjust your communication style to suit different customers.",
        "23. What methods do you employ to identify and target potential leads?",
        "24. Can you discuss some tools or techniques you use to analyze sales data?",
        "25. How do you showcase value to a customer hesitant to make a significant investment?",
        "26. Describe a time where you had to leverage your technical skills to close a sale.",
        "27. Discuss your experience with product launch strategies.",
        "28. How do you negotiate contracts and agreements ensuring both company and customer satisfaction?",
        "29. Can you describe a time when you worked with a challenging client and how you handled it?",
        "30. How would you assist a client who does not see the immediate benefit of our product?"
    ]
}